<?php
include('app/autoload.php');
// برای اجرا شدن اپلکیشن باید یکی از متد های روتر کال بشه تا مسیر یابی انجام بشه و بعد از اون کنترلر و اکشن مشخص بشه

// در اینجا ما از متد استاتیک parsURI استفاده میکنیم که مسیر یابی رو انجام میده
// و بعد از اون کنترلر و اکشن رو به صورت آرایه به متد استاتیک controler میفرسته
// که در کلاس کنترلر این آرایه دریافت میشه و کنترلر و اکشن رو استخراج میکنه و کنترلر رو اینستنس میکنه و اکشن رو صدا میزنه
// در نهایت خروجی اکشن رو برمیگردونه
// در اینجا ما از متد جادویی __callStatic استفاده میکنیم که وقتی متدی که وجود نداره صدا زده بشه این متد اجرا میشه
// و در اینجا ما از این متد برای صدا زدن متد controler استفاده میکنیم
// و آرگومان های متد controler رو از طریق آرگومان های متد __callStatic میگیریم
// و در نهایت خروجی متد controler رو برمیگردونیم


// در روتر باید مسیری که روتر باید اجرا کنه هم مشخص بشه ولی هنوز به اون رسیدگی نمیکنیم

router::get();
request::get();


//captureRequest()